Documents/бит_НачислениеПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачислениеПоЛицевымСчетам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КоличествоДнейСобственности</xr:Item>
				<xr:Item>InformationRegister.бит_СведенияОНормативахНачисленийЗакрытогоПериода</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОбъемыПоУслугамЖКХ</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоКоличествуДнейПроживания</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоПроживающих</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПроживающихВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПроживающихНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норматив</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативПотребленияПоКу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхномСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПоПроживающим</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПоДнямПраваСобственности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияОНормативахНачисленийЗакрытогоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОНормативахНачисленийЗакрытогоПериода</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СверхНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_НачислениеПоЛицевымСчетам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мРасчетСУчетомДолейВладения          Экспорт; // Хранит настройки актуальных параметров ЖКХ.
Перем мУменьшениеНормыЛьготыВПределахФакта Экспорт; // Хранит настройки актуальных параметров ЖКХ.
Перем мУчетДнейПРоживания Экспорт;                  // Хранит настройки актуальных параметров ЖКХ.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

Процедура ОбновитьПараметрыЖКХ() Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"         , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта", Ложь);
	
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Организация, ПараметрыЖКХ);
	
	мРасчетСУчетомДолейВладения          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мУменьшениеНормыЛьготыВПределахФакта = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	
	мУчетДнейПРоживания = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания; 
	
КонецПроцедуры

// Процедура производит расчеты. 
// И заполняет табличную часть.
//
Процедура РассчитатьНачисленияПоЛицевымСчетам() Экспорт 
	
	ЛицевыеСчета.Очистить();
	
	ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаПроживающих = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	// БИТ ЖКХ 08.04.2020
	ТаблицаПоДнямСобственности = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПоДнямСобственности();
	
	ОбновитьПараметрыЖКХ();
	
	СписокЛС     = Новый Массив;
	СписокЗданий = Новый Массив;
	
	СписокЗданий.Добавить(Здание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета";
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
	Запрос.УстановитьПараметр("Здание"            , Здание);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(Дата, Организация, СписокЛС, СписокЗданий, , , ТабЛицевыеСчета,,,,,,мРасчетСУчетомДолейВладения,,мУчетДнейПРоживания, ТаблицаПроживающих);
	
	// БИТ ЖКХ 17.04.2020
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
//	Запрос.УстановитьПараметр("Организация", Объект.ЛицевойСчет.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислениеСоДняПраваСобственности КАК НачислениеСоДняПраваСобственности
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата,) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НачислениеСоДняПраваСобственности = Выборка.НачислениеСоДняПраваСобственности;
	Иначе	
		НачислениеСоДняПраваСобственности = Ложь;
	КонецЕсли;

	если НачислениеСоДняПраваСобственности = истина тогда
	  // БИТ ЖКХ 09.04.2020
	  бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисленияПоДнямСобственности(Дата, Организация, СписокЛС, СписокЗданий, , , ТабЛицевыеСчета,,,,,,мРасчетСУчетомДолейВладения,,мУчетДнейПРоживания, ТаблицаПоДнямСобственности);
    конецесли;
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТабЛицевыеСчета);
	
	ЗаполнениеСчетовКУ(ТабЛицевыеСчета);
	
	ТабЛицевыеСчета.Сортировать("ЛицевойСчет ВОЗР"); 
	ЛицевыеСчета.Загрузить(ТабЛицевыеСчета);
	
	ТаблицаПроживающих.Сортировать("ЛицевойСчет ВОЗР");
	НачисленияПоПроживающим.Загрузить(ТаблицаПроживающих);
	
	// БИТ ЖКХ 08.04.2020
	ТаблицаПоДнямСобственности.Сортировать("ЛицевойСчет ВОЗР");
	НачисленияПоДнямПраваСобственности.Загрузить(ТаблицаПоДнямСобственности);
	
КонецПроцедуры	

// Процедура производит расчеты. 
// И заполняет табличную часть.
//
Процедура РассчитатьНачисленияПоДнямСобственности() Экспорт 
	
	ЛицевыеСчета.Очистить();
	
	ТабЛицевыеСчета    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	ТаблицаПроживающих = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
	
	ОбновитьПараметрыЖКХ();
	
	СписокЛС     = Новый Массив;
	СписокЗданий = Новый Массив;
	
	СписокЗданий.Добавить(Здание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета";
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
	Запрос.УстановитьПараметр("Здание"            , Здание);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(Дата, Организация, СписокЛС, СписокЗданий, , , ТабЛицевыеСчета,,,,,,мРасчетСУчетомДолейВладения,,мУчетДнейПРоживания, ТаблицаПроживающих);
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТабЛицевыеСчета);
	
	ЗаполнениеСчетовКУ(ТабЛицевыеСчета);
	
	ТабЛицевыеСчета.Сортировать("ЛицевойСчет ВОЗР"); 
	ЛицевыеСчета.Загрузить(ТабЛицевыеСчета);
	
	ТаблицаПроживающих.Сортировать("ЛицевойСчет ВОЗР");
	НачисленияПоПроживающим.Загрузить(ТаблицаПроживающих);
	
КонецПроцедуры	


// Процедура выполняет заполнение Счетов и Субконто.
//
Процедура ЗаполнениеСчетовКУ(ТабЛицевыеСчета=Неопределено) Экспорт 
	
	Если ТабЛицевыеСчета=Неопределено тогда
		СписокЛС = ЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ЛицевыеСчета.ВыгрузитьКолонки().Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ЛицевыеСчета, Колонки, СписокЛС, Организация , Дата);
	Иначе
		СписокЛС = ТабЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТабЛицевыеСчета.Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТабЛицевыеСчета, Колонки, СписокЛС, Организация , Дата);
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить.
	ОбязательныеРеквизитыШапки = "Организация,Улица,Здание";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	РеквизитыТабСписокУслуг = "Услуга,Сумма"; //через запятую.
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокУслуг", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам,ТаблицаПоПроживающим, ТаблицаПоДнямСобственности,Отказ, Заголовок)
	
	ДатаДока = Дата;
	СведенияОНормативах = Движения.бит_СведенияОНормативахНачисленийЗакрытогоПериода;
	НачислениеПоУсл     = Движения.бит_НачисленияПоУслугамЖКХ;
	НачислениеПоДням    = Движения.бит_НачисленияПоКоличествуДнейПроживания;
	ОбъемПоУслугам      = Движения.бит_ОбъемыПоУслугамЖКХ;
	
	// БИТ ЖКХ 08.04.2020
	НачислениеПоДнямСобственности  = Движения.бит_КоличествоДнейСобственности;
	
	НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;
	
	ТаблицаРасчетаНДС = Новый ТаблицаЗначений;
	Колонки = ТаблицаРасчетаНДС.Колонки;
	Колонки.Добавить("Номенклатура",	);
	Колонки.Добавить("СуммаНачислений",	ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Колонки.Добавить("СуммаБезНДС",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		Если СтрокаТЧ.Начислено <> 0 тогда	
			
			ДвиженияСв = СведенияОНормативах.Добавить();
			ДвиженияСв.Период      = ДатаДока;
			ДвиженияСв.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвиженияСв.Услуга      = СтрокаТЧ.Услуга;
			ДвиженияСв.Норма       = СтрокаТЧ.Норма;
			ДвиженияСв.СверхНорма  = СтрокаТЧ.СверхНорма;
			
			Движение = НачислениеПоУсл.Добавить();
			Движение.Период      = ДатаДока;
			Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
			Движение.Сумма       = СтрокаТЧ.Начислено;
			
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			
			ДвижениеУслПоПериоду			 		  = НачислениеПоУслПоПериоду.Добавить();
			ДвижениеУслПоПериоду.Период				  = ДатаДока;
			ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока);
			ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
			ДвижениеУслПоПериоду.Сумма				  = СтрокаТЧ.Начислено;
			ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
			
			ДвижениеОбъем = ОбъемПоУслугам.Добавить();
			ДвижениеОбъем.Период      = ДатаДока;
			ДвижениеОбъем.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
			ДвижениеОбъем.Объем       = СтрокаТЧ.Объем;
			
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Начисление по ЛС";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;				
								
				Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);
				Проводка.Сумма = СтрокаТЧ.Начислено;
				
				//10.04.2019
				если Проводка.СчетДт.Количественный = Истина тогда 
				  Проводка.КоличествоДт = СтрокаТЧ.Объем;
				конецесли; 
				
				если Проводка.СчетКт.Количественный = Истина тогда 
				  Проводка.КоличествоКт = СтрокаТЧ.Объем;
				конецесли; 
				
				Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
					Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
						НДС_Ставка= ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
						Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Начислено, НДС_Ставка); 
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли; 	
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из ТаблицаПоПроживающим Цикл
		
		Если СтрокаТЧ.Начислено <> 0 тогда
			Движение = НачислениеПоДням.Добавить();
			Движение.Период         = ДатаДока;
			Движение.ЛицевойСчет    = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ      = СтрокаТЧ.Услуга;
			Движение.ФизЛицо        = СтрокаТЧ.ФизЛицо;
			Движение.Сумма          = СтрокаТЧ.Начислено;
			Движение.КоличествоДней = СтрокаТЧ.КоличествоДней;
		КонецЕсли;
		
	КонецЦикла; 
	
	// БИТ ЖКХ 08.04.2020

	Для каждого СтрокаТЧ Из ТаблицаПоДнямСобственности Цикл
		
		Если СтрокаТЧ.Начислено <> 0 тогда
			Движение = НачислениеПоДнямСобственности.Добавить();
			Движение.Период         = ДатаДока;
			Движение.ЛицевойСчет    = СтрокаТЧ.ЛицевойСчет;
			Движение.Услуга         = СтрокаТЧ.Услуга;
			Движение.ФизЛицо        = СтрокаТЧ.ФизЛицо;
			Движение.Сумма          = СтрокаТЧ.Начислено;
			Движение.КоличествоДней = СтрокаТЧ.КоличествоДней;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

// Функция выполняет проверку на повторное закрытие месяца.
//
Функция ПроверкаПовторовДокументов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца" ,НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца"  ,КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация"  ,Организация);
	Запрос.УстановитьПараметр("Улица"        ,Улица);
	Запрос.УстановитьПараметр("Здание"       ,Здание);
	Запрос.УстановитьПараметр("Ссылка"       ,Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НачислениеПоЛицевымСчетам.Ссылка,
	|	НачислениеПоЛицевымСчетам.Проведен,
	|	НачислениеПоЛицевымСчетам.Организация,
	|	НачислениеПоЛицевымСчетам.Улица,
	|	НачислениеПоЛицевымСчетам.Здание,
	|	НачислениеПоЛицевымСчетам.Дата
	|ИЗ
	|	Документ.бит_НачислениеПоЛицевымСчетам КАК НачислениеПоЛицевымСчетам
	|ГДЕ
	|	НачислениеПоЛицевымСчетам.Организация = &Организация
	|	И НачислениеПоЛицевымСчетам.Дата >= &НачалоМесяца
	|	И НачислениеПоЛицевымСчетам.Дата <= &КонецМесяца
	|	И (НЕ НачислениеПоЛицевымСчетам.ПометкаУдаления)
	|	И НачислениеПоЛицевымСчетам.Улица = &Улица
	|	И НачислениеПоЛицевымСчетам.Здание = &Здание
	|	И НачислениеПоЛицевымСчетам.Ссылка <> &Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ТекстСообщения = "";
	Если Не Результат.Пустой() тогда
		ТекстСообщения = ТекстСообщения + "Документ в данном месяц уже создан.";
	КонецЕсли;
	Возврат ТекстСообщения;
	
Конецфункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"  ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Услуга"       ,"Услуга");
	СтруктураПолей.Вставить("Сумма"        ,"Сумма");
	СтруктураПолей.Вставить("Начислено"    ,"Начислено");
	
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	СтруктураПолей.Вставить("СпособРасчета","СпособРасчета");
	СтруктураПолей.Вставить("Ставка"  	   ,"Ставка");
	СтруктураПолей.Вставить("Объем"  	   ,"Объем");
	СтруктураПолей.Вставить("СверхСтавка"  ,"СверхСтавка");
	СтруктураПолей.Вставить("Норма"  	   ,"Норма");
	СтруктураПолей.Вставить("СверхНорма"   ,"СверхНорма");
	СтруктураПолей.Вставить("Начислено"    ,"Начислено");
	СтруктураПолей.Вставить("Тариф"        ,"Тариф");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	СтруктураПолейПрож = Новый Структура;
	СтруктураПолейПрож.Вставить("ЛицевойСчет"    ,"ЛицевойСчет");
	СтруктураПолейПрож.Вставить("Услуга"         ,"Услуга");
	СтруктураПолейПрож.Вставить("ФизЛицо"        ,"ФизЛицо");
	СтруктураПолейПрож.Вставить("КоличествоДней" ,"КоличествоДней");
	СтруктураПолейПрож.Вставить("Ставка"  		 ,"Ставка");
	СтруктураПолейПрож.Вставить("Начислено"      ,"Начислено");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НачисленияПоПроживающим", СтруктураПолейПрож);
	ТаблицаПоПроживающим      = РезультатЗапросаПоУслугам.Выгрузить();
	
	// БИТ ЖКХ 08.04.2020
	СтруктураПолейПрож = Новый Структура;
	СтруктураПолейПрож.Вставить("ЛицевойСчет"    ,"ЛицевойСчет");
	СтруктураПолейПрож.Вставить("Услуга"         ,"Услуга");
	СтруктураПолейПрож.Вставить("ФизЛицо"        ,"ФизЛицо");
	СтруктураПолейПрож.Вставить("КоличествоДней" ,"КоличествоДней");
	СтруктураПолейПрож.Вставить("Ставка"  		 ,"Ставка");
	СтруктураПолейПрож.Вставить("Начислено"      ,"Начислено");

	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НачисленияПоДнямПраваСобственности", СтруктураПолейПрож);
	ТаблицаПоДнямСобственности = РезультатЗапросаПоУслугам.Выгрузить();
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоПроживающим, ТаблицаПоДнямСобственности, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Для новых документов установим время в конец дня.
	Если ЭтоНовый() Тогда
		
		ДатаБезВремени = НачалоДня(ТекущаяДата());
		
		Если ДатаБезВремени = Дата Тогда
			
			Дата = ТекущаяДата();
			
		КонецЕсли;
		
	КонецЕсли;
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СообщенияОповторахВидовОпераций = ПроверкаПовторовДокументов();
	Если ЗначениеЗаполнено(СообщенияОповторахВидовОпераций) Тогда
		ТекстСообщения = СообщенияОповторахВидовОпераций;
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ЭтотОбъект));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТЗСписокЛС = ЛицевыеСчета.Выгрузить(,"ЛицевойСчет");
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
	ДокументСтруктура = Новый Структура;
	ДокументСтруктура.Вставить("Имя"            , Метаданные().Имя);
	ДокументСтруктура.Вставить("Ссылка"         , Ссылка);
	ДокументСтруктура.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	бит_РасчетыПоКоммунальнымУслугам.СинхронизацияПометкиНаУдалениеУСДокументамиРаспределенияРасходов(ДокументСтруктура);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Функция возвращает курс ставку НДС.
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс.
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты.
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат 20;
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат 10;
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат 18;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#КонецЕсли
